Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_ethernet.h
#define ETHERNET_MACCR_ARPEN                                        (0x1U<<31)
#define ETHERNET_MACCR_SARC                                         (0x7U<<28)
#define ETHERNET_MACCR_SARC_0                                       (0x1U<<28)
#define ETHERNET_MACCR_IPC                                          (0x1U<<27)
#define ETHERNET_MACCR_IPG                                          (0x7U<<24)
#define ETHERNET_MACCR_IPG_0                                        (0x1U<<24)
#define ETHERNET_MACCR_GPSLCE                                       (0x1U<<23)
#define ETHERNET_MACCR_S2KP                                         (0x1U<<22)
#define ETHERNET_MACCR_CST                                          (0x1U<<21)
#define ETHERNET_MACCR_ACS                                          (0x1U<<20)
#define ETHERNET_MACCR_WD                                           (0x1U<<19)
#define ETHERNET_MACCR_JD                                           (0x1U<<17)
#define ETHERNET_MACCR_JE                                           (0x1U<<16)
#define ETHERNET_MACCR_FES                                          (0x1U<<14)
#define ETHERNET_MACCR_DM                                           (0x1U<<13)
#define ETHERNET_MACCR_LM                                           (0x1U<<12)
#define ETHERNET_MACCR_ECRSFD                                       (0x1U<<11)
#define ETHERNET_MACCR_DO                                           (0x1U<<10)
#define ETHERNET_MACCR_DCRS                                         (0x1U<<9)
#define ETHERNET_MACCR_DR                                           (0x1U<<8)
#define ETHERNET_MACCR_BL                                           (0x3U<<5)
#define ETHERNET_MACCR_BL_0                                         (0x1U<<5)
#define ETHERNET_MACCR_DC                                           (0x1U<<4)
#define ETHERNET_MACCR_PRELEN                                       (0x3U<<2)
#define ETHERNET_MACCR_PRELEN_0                                     (0x1U<<2)
#define ETHERNET_MACCR_TE                                           (0x1U<<1)
#define ETHERNET_MACCR_RE                                           (0x1U<<0)

// MACECR Configuration

#define ETHERNET_MACECR_EIPG                                        (0x1FU<<25)
#define ETHERNET_MACECR_EIPG_0                                      (0x1U<<25)
#define ETHERNET_MACECR_EIPGEN                                      (0x1U<<24)
#define ETHERNET_MACECR_USP                                         (0x1U<<18)
#define ETHERNET_MACECR_SPEN                                        (0x1U<<17)
#define ETHERNET_MACECR_DCRCC                                       (0x1U<<16)
#define ETHERNET_MACECR_GPSL                                        (0x3FFFU<<0)
#define ETHERNET_MACECR_GPSL_0                                      (0x1U<<0)

// MACPFR Configuration

#define ETHERNET_MACPFR_RA                                          (0x1U<<31)
#define ETHERNET_MACPFR_DNTU                                        (0x1U<<21)
#define ETHERNET_MACPFR_IPFE                                        (0x1U<<20)
#define ETHERNET_MACPFR_VTFE                                        (0x1U<<16)
#define ETHERNET_MACPFR_HPF                                         (0x1U<<10)
#define ETHERNET_MACPFR_SAF                                         (0x1U<<9)
#define ETHERNET_MACPFR_SAIF                                        (0x1U<<8)
#define ETHERNET_MACPFR_PCF                                         (0x3U<<6)
#define ETHERNET_MACPFR_PCF_0                                       (0x1U<<6)
#define ETHERNET_MACPFR_DBF                                         (0x1U<<5)
#define ETHERNET_MACPFR_PM                                          (0x1U<<4)
#define ETHERNET_MACPFR_DAIF                                        (0x1U<<3)
#define ETHERNET_MACPFR_HMC                                         (0x1U<<2)
#define ETHERNET_MACPFR_HUC                                         (0x1U<<1)
#define ETHERNET_MACPFR_PR                                          (0x1U<<0)

// MACWTR Configuration

#define ETHERNET_MACWTR_PWE                                         (0x1U<<8)
#define ETHERNET_MACWTR_WTO                                         (0xFU<<0)
#define ETHERNET_MACWTR_WTO_0                                       (0x1U<<0)

// MACHT0R Configuration

#define ETHERNET_MACHT0R_HT31T0                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MACHT0R_HT31T0_0                                   (0x1U<<0)

// MACHT1R Configuration

#define ETHERNET_MACHT1R_HT63T32                                    (0xFFFFFFFFU<<0)
#define ETHERNET_MACHT1R_HT63T32_0                                  (0x1U<<0)

// MACVTR Configuration

#define ETHERNET_MACVTR_EIVLRXS                                     (0x1U<<31)
#define ETHERNET_MACVTR_EIVLS                                       (0x3U<<28)
#define ETHERNET_MACVTR_EIVLS_0                                     (0x1U<<28)
#define ETHERNET_MACVTR_ERIVLT                                      (0x1U<<27)
#define ETHERNET_MACVTR_EDVLP                                       (0x1U<<26)
#define ETHERNET_MACVTR_VTHM                                        (0x1U<<25)
#define ETHERNET_MACVTR_EVLRXS                                      (0x1U<<24)
#define ETHERNET_MACVTR_EVLS                                        (0x3U<<21)
#define ETHERNET_MACVTR_EVLS_0                                      (0x1U<<21)
#define ETHERNET_MACVTR_DOVLTC                                      (0x1U<<20)
#define ETHERNET_MACVTR_ERSVLM                                      (0x1U<<19)
#define ETHERNET_MACVTR_ESVL                                        (0x1U<<18)
#define ETHERNET_MACVTR_VTIM                                        (0x1U<<17)
#define ETHERNET_MACVTR_ETV                                         (0x1U<<16)
#define ETHERNET_MACVTR_VL                                          (0xFFFFU<<0)
#define ETHERNET_MACVTR_VL_0                                        (0x1U<<0)

// MACVHTR Configuration

#define ETHERNET_MACVHTR_VLHT                                       (0xFFFFU<<0)
#define ETHERNET_MACVHTR_VLHT_0                                     (0x1U<<0)

