Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_ethernet.h
// MACVIR Configuration

#define ETHERNET_MACVIR_VLTI                                        (0x1U<<20)
#define ETHERNET_MACVIR_CSVL                                        (0x1U<<19)
#define ETHERNET_MACVIR_VLP                                         (0x1U<<18)
#define ETHERNET_MACVIR_VLC                                         (0x3U<<16)
#define ETHERNET_MACVIR_VLC_0                                       (0x1U<<16)
#define ETHERNET_MACVIR_VLT                                         (0xFFFFU<<0)
#define ETHERNET_MACVIR_VLT_0                                       (0x1U<<0)

// MACIVIR Configuration

#define ETHERNET_MACIVIR_VLTI                                       (0x1U<<20)
#define ETHERNET_MACIVIR_CSVL                                       (0x1U<<19)
#define ETHERNET_MACIVIR_VLP                                        (0x1U<<18)
#define ETHERNET_MACIVIR_VLC                                        (0x3U<<16)
#define ETHERNET_MACIVIR_VLC_0                                      (0x1U<<16)
#define ETHERNET_MACIVIR_VLT                                        (0xFFFFU<<0)
#define ETHERNET_MACIVIR_VLT_0                                      (0x1U<<0)

// MACQTXFCR Configuration

#define ETHERNET_MACQTXFCR_PT                                       (0xFFFFU<<16)
#define ETHERNET_MACQTXFCR_PT_0                                     (0x1U<<16)
#define ETHERNET_MACQTXFCR_DZPQ                                     (0x1U<<7)
#define ETHERNET_MACQTXFCR_PLT                                      (0x7U<<4)
#define ETHERNET_MACQTXFCR_PLT_0                                    (0x1U<<4)
#define ETHERNET_MACQTXFCR_TFE                                      (0x1U<<1)
#define ETHERNET_MACQTXFCR_FCB_BPA                                  (0x1U<<0)

// MACRXFCR Configuration

#define ETHERNET_MACRXFCR_UP                                        (0x1U<<1)
#define ETHERNET_MACRXFCR_RFE                                       (0x1U<<0)

// MACISR Configuration

#define ETHERNET_MACISR_RXSTSIS                                     (0x1U<<14)
#define ETHERNET_MACISR_TXSTSIS                                     (0x1U<<13)
#define ETHERNET_MACISR_TSIS                                        (0x1U<<12)
#define ETHERNET_MACISR_MMCTXIS                                     (0x1U<<10)
#define ETHERNET_MACISR_MMCRXIS                                     (0x1U<<9)
#define ETHERNET_MACISR_MMCIS                                       (0x1U<<8)
#define ETHERNET_MACISR_LPIIS                                       (0x1U<<5)
#define ETHERNET_MACISR_PMTIS                                       (0x1U<<4)
#define ETHERNET_MACISR_PHYIS                                       (0x1U<<3)

// MACIER Configuration

#define ETHERNET_MACIER_RXSTSIE                                     (0x1U<<14)
#define ETHERNET_MACIER_TXSTSIE                                     (0x1U<<13)
#define ETHERNET_MACIER_TSIE                                        (0x1U<<12)
#define ETHERNET_MACIER_LPIIE                                       (0x1U<<5)
#define ETHERNET_MACIER_PMTIE                                       (0x1U<<4)
#define ETHERNET_MACIER_PHYIE                                       (0x1U<<3)

// MACRXTXSR Configuration

#define ETHERNET_MACRXTXSR_RWT                                      (0x1U<<8)
#define ETHERNET_MACRXTXSR_EXCOL                                    (0x1U<<5)
#define ETHERNET_MACRXTXSR_LCOL                                     (0x1U<<4)
#define ETHERNET_MACRXTXSR_EXDEF                                    (0x1U<<3)
#define ETHERNET_MACRXTXSR_LCARR                                    (0x1U<<2)
#define ETHERNET_MACRXTXSR_NCARR                                    (0x1U<<1)
#define ETHERNET_MACRXTXSR_TJT                                      (0x1U<<0)

// MACPCSR Configuration

#define ETHERNET_MACPCSR_RWKFILTRST                                 (0x1U<<31)
#define ETHERNET_MACPCSR_RWKPTR                                     (0x1FU<<24)
#define ETHERNET_MACPCSR_RWKPTR_0                                   (0x1U<<24)
#define ETHERNET_MACPCSR_RWKPFE                                     (0x1U<<10)
#define ETHERNET_MACPCSR_GLBLUCAST                                  (0x1U<<9)
#define ETHERNET_MACPCSR_RWKPRCVD                                   (0x1U<<6)
#define ETHERNET_MACPCSR_MGKPRCVD                                   (0x1U<<5)
#define ETHERNET_MACPCSR_RWKPKTEN                                   (0x1U<<2)
#define ETHERNET_MACPCSR_MGKPKTEN                                   (0x1U<<1)
#define ETHERNET_MACPCSR_PWRDWN                                     (0x1U<<0)

// MACRWKPFR Configuration

#define ETHERNET_MACRWKPFR_WKUPFRMFTR                               (0xFFFFFFFFU<<0)
#define ETHERNET_MACRWKPFR_WKUPFRMFTR_0                             (0x1U<<0)

// MACLCSR Configuration

#define ETHERNET_MACLCSR_LPITCSE                                    (0x1U<<21)
#define ETHERNET_MACLCSR_LPITE                                      (0x1U<<20)
#define ETHERNET_MACLCSR_LPITXA                                     (0x1U<<19)
#define ETHERNET_MACLCSR_PLSEN                                      (0x1U<<18)
#define ETHERNET_MACLCSR_PLS                                        (0x1U<<17)
#define ETHERNET_MACLCSR_LPIEN                                      (0x1U<<16)
#define ETHERNET_MACLCSR_RLPIST                                     (0x1U<<9)
#define ETHERNET_MACLCSR_TLPIST                                     (0x1U<<8)
#define ETHERNET_MACLCSR_RLPIEX                                     (0x1U<<3)
#define ETHERNET_MACLCSR_RLPIEN                                     (0x1U<<2)
#define ETHERNET_MACLCSR_TLPIEX                                     (0x1U<<1)
#define ETHERNET_MACLCSR_TLPIEN                                     (0x1U<<0)

// MACLTCR Configuration

#define ETHERNET_MACLTCR_LST                                        (0x3FFU<<16)
#define ETHERNET_MACLTCR_LST_0                                      (0x1U<<16)
#define ETHERNET_MACLTCR_TWT                                        (0xFFFFU<<0)
#define ETHERNET_MACLTCR_TWT_0                                      (0x1U<<0)

// MACLETR Configuration

#define ETHERNET_MACLETR_LPIET                                      (0x1FFFFU<<0)
#define ETHERNET_MACLETR_LPIET_0                                    (0x1U<<0)

// MAC1USTCR Configuration

#define ETHERNET_MAC1USTCR_TIC_1US_CNTR                             (0xFFFU<<0)
#define ETHERNET_MAC1USTCR_TIC_1US_CNTR_0                           (0x1U<<0)

// MACVR Configuration

#define ETHERNET_MACVR_USERVER                                      (0xFFU<<8)
#define ETHERNET_MACVR_USERVER_0                                    (0x1U<<8)
#define ETHERNET_MACVR_SNPSVER                                      (0xFFU<<0)
#define ETHERNET_MACVR_SNPSVER_0                                    (0x1U<<0)

// MACDR Configuration

#define ETHERNET_MACDR_TFCSTS                                       (0x3U<<17)
#define ETHERNET_MACDR_TFCSTS_0                                     (0x1U<<17)
#define ETHERNET_MACDR_TPESTS                                       (0x1U<<16)
#define ETHERNET_MACDR_RFCFCSTS                                     (0x3U<<1)
#define ETHERNET_MACDR_RFCFCSTS_0                                   (0x1U<<1)
#define ETHERNET_MACDR_RPESTS                                       (0x1U<<0)

// MACHWF1R Configuration

#define ETHERNET_MACHWF1R_L3L4FNUM                                  (0xFU<<27)
#define ETHERNET_MACHWF1R_L3L4FNUM_0                                (0x1U<<27)
#define ETHERNET_MACHWF1R_HASHTBLSZ                                 (0x3U<<24)
#define ETHERNET_MACHWF1R_HASHTBLSZ_0                               (0x1U<<24)
#define ETHERNET_MACHWF1R_AVSEL                                     (0x1U<<20)
#define ETHERNET_MACHWF1R_DBGMEMA                                   (0x1U<<19)
#define ETHERNET_MACHWF1R_TSOEN                                     (0x1U<<18)
#define ETHERNET_MACHWF1R_SPHEN                                     (0x1U<<17)
#define ETHERNET_MACHWF1R_DCBEN                                     (0x1U<<16)
#define ETHERNET_MACHWF1R_ADVTHWORD                                 (0x1U<<13)
#define ETHERNET_MACHWF1R_PTOEN                                     (0x1U<<12)
#define ETHERNET_MACHWF1R_OSTEN                                     (0x1U<<11)
#define ETHERNET_MACHWF1R_TXFIFOSIZE                                (0x1FU<<6)
#define ETHERNET_MACHWF1R_TXFIFOSIZE_0                              (0x1U<<6)
#define ETHERNET_MACHWF1R_RXFIFOSIZE                                (0x1FU<<0)
#define ETHERNET_MACHWF1R_RXFIFOSIZE_0                              (0x1U<<0)

// MACHWF2R Configuration

