Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_ethernet.h
#define ETHERNET_MACHWF2R_AUXSNAPNUM                                (0x7U<<28)
#define ETHERNET_MACHWF2R_AUXSNAPNUM_0                              (0x1U<<28)
#define ETHERNET_MACHWF2R_PPSOUTNUM                                 (0x7U<<24)
#define ETHERNET_MACHWF2R_PPSOUTNUM_0                               (0x1U<<24)
#define ETHERNET_MACHWF2R_TXCHCNT                                   (0xFU<<18)
#define ETHERNET_MACHWF2R_TXCHCNT_0                                 (0x1U<<18)
#define ETHERNET_MACHWF2R_RXCHCNT                                   (0xFU<<12)
#define ETHERNET_MACHWF2R_RXCHCNT_0                                 (0x1U<<12)
#define ETHERNET_MACHWF2R_TXQCNT                                    (0xFU<<6)
#define ETHERNET_MACHWF2R_TXQCNT_0                                  (0x1U<<6)
#define ETHERNET_MACHWF2R_RXQCNT                                    (0xFU<<0)
#define ETHERNET_MACHWF2R_RXQCNT_0                                  (0x1U<<0)

// MACMDIOAR Configuration

#define ETHERNET_MACMDIOAR_PSE                                      (0x1U<<27)
#define ETHERNET_MACMDIOAR_BTB                                      (0x1U<<26)
#define ETHERNET_MACMDIOAR_PA                                       (0x1FU<<21)
#define ETHERNET_MACMDIOAR_PA_0                                     (0x1U<<21)
#define ETHERNET_MACMDIOAR_RDA                                      (0x1FU<<16)
#define ETHERNET_MACMDIOAR_RDA_0                                    (0x1U<<16)
#define ETHERNET_MACMDIOAR_NTC                                      (0x7U<<12)
#define ETHERNET_MACMDIOAR_NTC_0                                    (0x1U<<12)
#define ETHERNET_MACMDIOAR_CR                                       (0xFU<<8)
#define ETHERNET_MACMDIOAR_CR_0                                     (0x1U<<8)
#define ETHERNET_MACMDIOAR_SKAP                                     (0x1U<<4)
#define ETHERNET_MACMDIOAR_GOC                                      (0x3U<<2)
#define ETHERNET_MACMDIOAR_GOC_0                                    (0x1U<<2)
#define ETHERNET_MACMDIOAR_C45E                                     (0x1U<<1)
#define ETHERNET_MACMDIOAR_MB                                       (0x1U<<0)

// MACMDIODR Configuration

#define ETHERNET_MACMDIODR_RA                                       (0xFFFFU<<16)
#define ETHERNET_MACMDIODR_RA_0                                     (0x1U<<16)
#define ETHERNET_MACMDIODR_MD                                       (0xFFFFU<<0)
#define ETHERNET_MACMDIODR_MD_0                                     (0x1U<<0)

// MACA0HR Configuration

#define ETHERNET_MACA0HR_AE                                         (0x1U<<31)
#define ETHERNET_MACA0HR_ADDRHI                                     (0xFFFFU<<0)
#define ETHERNET_MACA0HR_ADDRHI_0                                   (0x1U<<0)

// MACA0LR Configuration

#define ETHERNET_MACA0LR_ADDRLO                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MACA0LR_ADDRLO_0                                   (0x1U<<0)

// MACA1HR Configuration

#define ETHERNET_MACA1HR_AE                                         (0x1U<<31)
#define ETHERNET_MACA1HR_SA                                         (0x1U<<30)
#define ETHERNET_MACA1HR_MBC                                        (0x3FU<<24)
#define ETHERNET_MACA1HR_MBC_0                                      (0x1U<<24)
#define ETHERNET_MACA1HR_ADDRHI                                     (0xFFFFU<<0)
#define ETHERNET_MACA1HR_ADDRHI_0                                   (0x1U<<0)

// MACA1LR Configuration

#define ETHERNET_MACA1LR_ADDRLO                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MACA1LR_ADDRLO_0                                   (0x1U<<0)

// MACA2HR Configuration

#define ETHERNET_MACA2HR_AE                                         (0x1U<<31)
#define ETHERNET_MACA2HR_SA                                         (0x1U<<30)
#define ETHERNET_MACA2HR_MBC                                        (0x3FU<<24)
#define ETHERNET_MACA2HR_MBC_0                                      (0x1U<<24)
#define ETHERNET_MACA2HR_ADDRHI                                     (0xFFFFU<<0)
#define ETHERNET_MACA2HR_ADDRHI_0                                   (0x1U<<0)

// MACA2LR Configuration

#define ETHERNET_MACA2LR_ADDRLO                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MACA2LR_ADDRLO_0                                   (0x1U<<0)

// MACA3HR Configuration

#define ETHERNET_MACA3HR_AE                                         (0x1U<<31)
#define ETHERNET_MACA3HR_SA                                         (0x1U<<30)
#define ETHERNET_MACA3HR_MBC                                        (0x3FU<<24)
#define ETHERNET_MACA3HR_MBC_0                                      (0x1U<<24)
#define ETHERNET_MACA3HR_ADDRHI                                     (0xFFFFU<<0)
#define ETHERNET_MACA3HR_ADDRHI_0                                   (0x1U<<0)

// MACA3LR Configuration

#define ETHERNET_MACA3LR_ADDRLO                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MACA3LR_ADDRLO_0                                   (0x1U<<0)

// MMC_CONTROL Configuration

#define ETHERNET_MMC_CONTROL_UCDBC                                  (0x1U<<8)
#define ETHERNET_MMC_CONTROL_CNTPRSTLVL                             (0x1U<<5)
#define ETHERNET_MMC_CONTROL_CNTPRST                                (0x1U<<4)
#define ETHERNET_MMC_CONTROL_CNTFREEZ                               (0x1U<<3)
#define ETHERNET_MMC_CONTROL_RSTONRD                                (0x1U<<2)
#define ETHERNET_MMC_CONTROL_CNTSTOPRO                              (0x1U<<1)
#define ETHERNET_MMC_CONTROL_CNTRST                                 (0x1U<<0)

// MMC_RX_INTERRUPT Configuration

#define ETHERNET_MMC_RX_INTERRUPT_RXLPITRCIS                        (0x1U<<27)
#define ETHERNET_MMC_RX_INTERRUPT_RXLPIUSCIS                        (0x1U<<26)
#define ETHERNET_MMC_RX_INTERRUPT_RXUCGPIS                          (0x1U<<17)
#define ETHERNET_MMC_RX_INTERRUPT_RXALGNERPIS                       (0x1U<<6)
#define ETHERNET_MMC_RX_INTERRUPT_RXCRCERPIS                        (0x1U<<5)

// MMC_TX_INTERRUPT Configuration

#define ETHERNET_MMC_TX_INTERRUPT_TXLPITRCIS                        (0x1U<<27)
#define ETHERNET_MMC_TX_INTERRUPT_TXLPIUSCIS                        (0x1U<<26)
#define ETHERNET_MMC_TX_INTERRUPT_TXGPKTIS                          (0x1U<<21)
#define ETHERNET_MMC_TX_INTERRUPT_TXMCOLGPIS                        (0x1U<<15)
#define ETHERNET_MMC_TX_INTERRUPT_TXSCOLGPIS                        (0x1U<<14)

// MMC_RX_INTERRUPT_MASK Configuration

