Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_ethernet.h
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXLPITRCIM                   (0x1U<<27)
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM                   (0x1U<<26)
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXUCGPIM                     (0x1U<<17)
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXALGNERPIM                  (0x1U<<6)
#define ETHERNET_MMC_RX_INTERRUPT_MASK_RXCRCERPIM                   (0x1U<<5)

// MMC_TX_INTERRUPT_MASK Configuration

#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXLPITRCIM                   (0x1U<<27)
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM                   (0x1U<<26)
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXGPKTIM                     (0x1U<<21)
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM                   (0x1U<<15)
#define ETHERNET_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM                   (0x1U<<14)

// TX_SINGLE_COLLISION_GOOD_PACKETS Configuration

#define ETHERNET_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG        (0xFFFFFFFFU<<0)
#define ETHERNET_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_0      (0x1U<<0)

// TX_MULTIPLE_COLLISION_GOOD_PACKETS Configuration

#define ETHERNET_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG      (0xFFFFFFFFU<<0)
#define ETHERNET_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_0    (0x1U<<0)

// TX_PACKET_COUNT_GOOD Configuration

#define ETHERNET_TX_PACKET_COUNT_GOOD_TXPKTG                        (0xFFFFFFFFU<<0)
#define ETHERNET_TX_PACKET_COUNT_GOOD_TXPKTG_0                      (0x1U<<0)

// RX_CRC_ERROR_PACKETS Configuration

#define ETHERNET_RX_CRC_ERROR_PACKETS_RXCRCERR                      (0xFFFFFFFFU<<0)
#define ETHERNET_RX_CRC_ERROR_PACKETS_RXCRCERR_0                    (0x1U<<0)

// RX_ALIGNMENT_ERROR_PACKETS Configuration

#define ETHERNET_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR               (0xFFFFFFFFU<<0)
#define ETHERNET_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_0             (0x1U<<0)

// RX_UNICAST_PACKETS_GOOD Configuration

#define ETHERNET_RX_UNICAST_PACKETS_GOOD_RXUCASTG                   (0xFFFFFFFFU<<0)
#define ETHERNET_RX_UNICAST_PACKETS_GOOD_RXUCASTG_0                 (0x1U<<0)

// TX_LPI_USEC_CNTR Configuration

#define ETHERNET_TX_LPI_USEC_CNTR_TXLPIUSC                          (0xFFFFFFFFU<<0)
#define ETHERNET_TX_LPI_USEC_CNTR_TXLPIUSC_0                        (0x1U<<0)

// TX_LPI_TRAN_CNTR Configuration

#define ETHERNET_TX_LPI_TRAN_CNTR_TXLPITRC                          (0xFFFFFFFFU<<0)
#define ETHERNET_TX_LPI_TRAN_CNTR_TXLPITRC_0                        (0x1U<<0)

// RX_LPI_USEC_CNTR Configuration

#define ETHERNET_RX_LPI_USEC_CNTR_RXLPIUSC                          (0xFFFFFFFFU<<0)
#define ETHERNET_RX_LPI_USEC_CNTR_RXLPIUSC_0                        (0x1U<<0)

// RX_LPI_TRAN_CNTR Configuration

#define ETHERNET_RX_LPI_TRAN_CNTR_RXLPITRC                          (0xFFFFFFFFU<<0)
#define ETHERNET_RX_LPI_TRAN_CNTR_RXLPITRC_0                        (0x1U<<0)

// MACL3L4C0R Configuration

#define ETHERNET_MACL3L4C0R_L4DPIM0                                 (0x1U<<21)
#define ETHERNET_MACL3L4C0R_L4DPM0                                  (0x1U<<20)
#define ETHERNET_MACL3L4C0R_L4SPIM0                                 (0x1U<<19)
#define ETHERNET_MACL3L4C0R_L4SPM0                                  (0x1U<<18)
#define ETHERNET_MACL3L4C0R_L4PEN0                                  (0x1U<<16)
#define ETHERNET_MACL3L4C0R_L3HDBM0                                 (0x1FU<<11)
#define ETHERNET_MACL3L4C0R_L3HDBM0_0                               (0x1U<<11)
#define ETHERNET_MACL3L4C0R_L3HSBM0                                 (0x1FU<<6)
#define ETHERNET_MACL3L4C0R_L3HSBM0_0                               (0x1U<<6)
#define ETHERNET_MACL3L4C0R_L3DAIM0                                 (0x1U<<5)
#define ETHERNET_MACL3L4C0R_L3DAM0                                  (0x1U<<4)
#define ETHERNET_MACL3L4C0R_L3SAIM0                                 (0x1U<<3)
#define ETHERNET_MACL3L4C0R_L3SAM0                                  (0x1U<<2)
#define ETHERNET_MACL3L4C0R_L3PEN0                                  (0x1U<<0)

// MACL4A0R Configuration

#define ETHERNET_MACL4A0R_L4DP0                                     (0xFFFFU<<16)
#define ETHERNET_MACL4A0R_L4DP0_0                                   (0x1U<<16)
#define ETHERNET_MACL4A0R_L4SP0                                     (0xFFFFU<<0)
#define ETHERNET_MACL4A0R_L4SP0_0                                   (0x1U<<0)

// MACL3A00R Configuration

#define ETHERNET_MACL3A00R_L3A00                                    (0xFFFFFFFFU<<0)
#define ETHERNET_MACL3A00R_L3A00_0                                  (0x1U<<0)

// MACL3A10R Configuration

#define ETHERNET_MACL3A10R_L3A10                                    (0xFFFFFFFFU<<0)
#define ETHERNET_MACL3A10R_L3A10_0                                  (0x1U<<0)

// MACL3A20 Configuration

#define ETHERNET_MACL3A20_L3A20                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MACL3A20_L3A20_0                                   (0x1U<<0)

// MACL3A30 Configuration

#define ETHERNET_MACL3A30_L3A30                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MACL3A30_L3A30_0                                   (0x1U<<0)

// MACL3L4C1R Configuration

#define ETHERNET_MACL3L4C1R_L4DPIM1                                 (0x1U<<21)
#define ETHERNET_MACL3L4C1R_L4DPM1                                  (0x1U<<20)
#define ETHERNET_MACL3L4C1R_L4SPIM1                                 (0x1U<<19)
#define ETHERNET_MACL3L4C1R_L4SPM1                                  (0x1U<<18)
#define ETHERNET_MACL3L4C1R_L4PEN1                                  (0x1U<<16)
#define ETHERNET_MACL3L4C1R_L3HDBM1                                 (0x1FU<<11)
#define ETHERNET_MACL3L4C1R_L3HDBM1_0                               (0x1U<<11)
#define ETHERNET_MACL3L4C1R_L3HSBM1                                 (0x1FU<<6)
#define ETHERNET_MACL3L4C1R_L3HSBM1_0                               (0x1U<<6)
#define ETHERNET_MACL3L4C1R_L3DAIM1                                 (0x1U<<5)
#define ETHERNET_MACL3L4C1R_L3DAM1                                  (0x1U<<4)
#define ETHERNET_MACL3L4C1R_L3SAIM1                                 (0x1U<<3)
#define ETHERNET_MACL3L4C1R_L3SAM1                                  (0x1U<<2)
#define ETHERNET_MACL3L4C1R_L3PEN1                                  (0x1U<<0)

